app/controllers/makes_controller.rb

  def index
    @makes = Make.all
---
SELECT "makes".* FROM "makes"

  def create
    @make = Make.new(make_params)

    respond_to do |format|
      if @make.save
---
INSERT INTO "makes" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Toyota"], ["country", "Japan"], ["created_at", "2019-09-22 21:36:10.020407"], ["updated_at", "2019-09-22 21:36:10.020407"]]

  def search
    @makes = Make.where("name like :search or country like :search", search: "%#{params[:query]}%")
---
SELECT "makes".* FROM "makes" WHERE (name like '%germany%' or country like '%germany%')

    def set_make
      @make = Make.find(params[:id])
---
SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]