app/controllers/parts_controller.rb

  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save
---
INSERT INTO "parts" ("name", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "windshield"], ["quantity", 20], ["created_at", "2019-09-22 21:35:12.796839"], ["updated_at", "2019-09-22 21:35:12.796839"]]

  def update
    respond_to do |format|
      if @part.update(part_params)
---
UPDATE "parts" SET "quantity" = ?, "updated_at" = ? WHERE "parts"."id" = ?  [["quantity", 3], ["updated_at", "2019-11-21 20:51:30.719625"], ["id", 6]]

    def set_part
      @part = Part.find(params[:id])
---
SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]