app/views/cars/_form.html.erb

SELECT "makes".* FROM "makes"
---
    <%= form.label :make_id %>
    <%= form.collection_select :make_id, Make.all, :id, :name %>